app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]
---
  def create
    @song = Song.new(song_params)

    binding.pry
    if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "songs" SET "title" = ?, "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Heartbreaker"], ["artist_id", 8], ["updated_at", "2020-12-28 21:41:06.166027"], ["id", 1]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)